# Parameters
nc: 1  # Number of classes (Change to 2 if using the Ultralytics brain-tumor dataset)
scales:
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2 (Stem Convolution)
  - [-1, 1, GhostConv, [128, 3, 2]]    # 1-P2/4 (Lightweight Downsampling)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, GhostConv, [256, 3, 2]]    # 3-P3/8 
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4:  -> OUTPUT P3 (Stride 8)
  - [-1, 1, GhostConv, [512, 3, 2]]    # 5-P4/16 
  - [-1, 2, C3k2, [512, True]]         # 6:  -> OUTPUT P4 (Stride 16)
  - [-1, 1, GhostConv, [1024, 3, 2]]   # 7-P5/32 
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10: -> OUTPUT P5 (Stride 32 + Self-Attention)

head:
  # [from, repeats, module, args]
  # 11: Route P3, P4, P5 into the custom CBAM + BiFPN Neck. Output unified to 256 channels.
  - [[4, 6, 10], 1, CbamBiFPN_Neck, [256]] 
  
  # 12: Standard YOLO Decoupled Detection Head
  - [11, 1, Detect, [nc]]
