nc: 1  # 1 class for BR35H ('Tumor')
scales:
  s: [0.33, 0.50, 1024] 

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2 (Stem remains standard Conv)
  - [-1, 1, GhostConv, [128, 3, 2]]    # 1-P2/4 (Isolated variable)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, GhostConv, [256, 3, 2]]    # 3-P3/8 (Isolated variable)
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, GhostConv, [512, 3, 2]]    # 5-P4/16 (Isolated variable)
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, GhostConv, [1024, 3, 2]]   # 7-P5/32 (Isolated variable)
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10

head:
  # 100% Vanilla YOLO11 Neck - Zero Confounding Variables
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]          # cat backbone P4
  - [-1, 2, C3k2, [512, False]]        # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]          # cat backbone P3
  - [-1, 2, C3k2, [256, False]]        # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]         # 17 (Restored to Standard Conv)
  - [[-1, 13], 1, Concat, [1]]         # cat head P4
  - [-1, 2, C3k2, [512, False]]        # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]         # 20 (Restored to Standard Conv)
  - [[-1, 10], 1, Concat, [1]]         # cat head P5
  - [-1, 2, C3k2, [1024, True]]        # 22 (P5/32-large)

  - [[16, 19, 22], 1, Detect, [nc]]    # 23 Detect
